# Manipulando Dados
## Biblioteca Pandas

## Dados Tabulares

* Primeira linha: Cabeçalho (*Header*)
* Cada coluna: uma variável
* Cada linha: uma observação
* Cada Tabela/arquivo: um nível de observação

![dados-tabulares](https://miro.medium.com/max/3840/1*7jjzhy4KknPz9hJVnC_w7w.png)

In [2]:
# O resultado de um dataset (conjunto de dados), no Pandas,
# é chamado de DataFrame
# Passos para trabalhar com pandas
# 1 - importar a bilioteca
# 2 - Carregar os dados para uma variável
# 3 - Verificar o dataset

In [3]:
# 1 - importar a bilioteca
import pandas as pd

In [4]:
# 2 - Carregar os dados para uma variável
dataset = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

# df é uma abreviação para DataFrame
df = pd.read_csv(dataset)

In [5]:
# mostra um DataFrame fragmentado
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [6]:
# Verificando as cinco primeiras linhas
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
# Verificar um número de linhas específico no início
df.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [8]:
# Verificando dados no final do DataFrame
df.tail() # tail é cauda (final)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [9]:
# Verificar um número de linhas específico no final
df.tail(2)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[2 rows x 12 columns]

In [12]:
# Verificando aleatoriamente
df.sample(5) # sample significa "amostra"

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
642          643         0       3  ...  27.9000   NaN         S
511          512         0       3  ...   8.0500   NaN         S
370          371         1       1  ...  55.4417   E50         C
106          107         1       3  ...   7.6500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q

[5 rows x 12 columns]

In [14]:
# Verificando número de colunas e de linhas
df.shape

(891, 12)

In [15]:
# Mostrando individualmente número de linhas e de colunas
print('Observações:', df.shape[0])
print('Variáveis..:', df.shape[1])

Observações: 891
Variáveis..: 12

In [16]:
# Descobrindo o tipo das variáveis
# O tipo object é uma String
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [19]:
# Visualizando o nome das colunas (variáveis)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [20]:
for coluna in df.columns:
  print(coluna)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [22]:
# Verificando dados estatísticos
df.describe

<bound method NDFrame.describe of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

In [23]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [24]:
df.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]

In [25]:
# Visualizando o índice do DataFrame
df.index

RangeIndex(start=0, stop=891, step=1)

In [26]:
# Como definir uma outra coluna (variável) como índice?
df.set_index('PassengerId', inplace=True)
df.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [28]:
# Consultando "coisas".....
# loc() - esse comando faz pesquisas dentro de um DataFrame
# Podemos usar listas para representar parâmetros de busca

# Quem é o primeiro passageiro?
df.loc[1]

Survived                          0
Pclass                            3
Name        Braund, Mr. Owen Harris
Sex                            male
Age                              22
SibSp                             1
Parch                             0
Ticket                    A/5 21171
Fare                           7.25
Cabin                           NaN
Embarked                          S
Name: 1, dtype: object

In [29]:
# Quem são os três primeiros passageiros?
df.loc[0:3]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S

[3 rows x 11 columns]

In [30]:
# Quem são o primeiro, terceiro e quinto passageiros?
df.loc[ [1, 3, 5] ]

             Survived  Pclass                      Name  ...   Fare  Cabin  Embarked
PassengerId                                              ...
1                   0       3   Braund, Mr. Owen Harris  ...  7.250    NaN         S
3                   1       3    Heikkinen, Miss. Laina  ...  7.925    NaN         S
5                   0       3  Allen, Mr. William Henry  ...  8.050    NaN         S

[3 rows x 11 columns]

In [31]:
# Outra forma sem usar lista
df.loc[0:6:2]

             Survived  Pclass                      Name  ...   Fare  Cabin  Embarked
PassengerId                                              ...
1                   0       3   Braund, Mr. Owen Harris  ...  7.250    NaN         S
3                   1       3    Heikkinen, Miss. Laina  ...  7.925    NaN         S
5                   0       3  Allen, Mr. William Henry  ...  8.050    NaN         S

[3 rows x 11 columns]

In [34]:
# Vamos especificar nossa consulta
df.loc[ 0:6:2, ['Name', 'Sex', 'Age'] ]

                                 Name     Sex   Age
PassengerId
1             Braund, Mr. Owen Harris    male  22.0
3              Heikkinen, Miss. Laina  female  26.0
5            Allen, Mr. William Henry    male  35.0

In [36]:
# Qual a média de idade entre os cinco primeiros passageiros
df.loc[0:5].mean()

Survived     0.60000
Pclass       2.20000
Age         31.20000
SibSp        0.60000
Parch        0.00000
Fare        29.52166
dtype: float64

In [37]:
# Como ppesquisar com parâmetros
df.query('Age > 20').head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [46]:
# Ampliando a pesquisa
print('Mulheres:', df.query('Sex=="female"').shape[0])
print('Homens..:', df.query('Sex=="male"').shape[0])

Mulheres: 314
Homens..: 577

In [ ]:
# Vamos praticar
# Mostrar apenas as mulheres (qtd) que sobreviveram e são maiores de idade (159)
# Mostrar apenas as mulheres (qtd)  que sobreviveram e são menores de idade (38)
# Existia algum passageiro com idade inferior a 10 anos? (64)
# Quantas mulheres estavam na terceira classe? (144)

In [48]:
# Mostrar apenas as mulheres (qtd) que sobreviveram e são maiores de idade (159)
df.query('Age > 17 & Sex=="female" & Survived==1').shape[0]

159

In [49]:
# Mostrar apenas as mulheres (qtd)  que sobreviveram e são menores de idade (38)
df.query('Age < 18 & Sex=="female" & Survived==1').shape[0]

38

In [50]:
# Existia algum passageiro com idade inferior a 10 anos? (62)
df.query('Age < 10').shape[0]

62

In [51]:
# Quantas mulheres estavam na terceira classe? (144)
df.query('Sex=="female" & Pclass==3').shape[0]

144

In [58]:
df_novo = df.loc[ 0:10, ['Name', 'Sex', 'Age', 'Pclass'] ]

df_novo.query('Sex=="female" & Pclass==3').shape[0]
df_novo.to_excel('saida.xlsx')